{
    "data": {
        "count": 7,
        "next": "https://yahoo-scraper.p.rapidapi.com/search/?query=mango&offset=14",
        "previous": "https://yahoo-scraper.p.rapidapi.com/search/?query=mango&offset=0",
        "results": [
            {
                "title": "Fashion for Women | Mango USA",
                "link": "https://shop.mango.com/us/women",
                "description": "Latest trends in fashion for women. Discover our designs: dresses, tops, jeans, shoes, bags and accessories. Free delivery from US$50 - Returns within 30 days - Pay in 4 interest-free installments."
            },
            {
                "title": "Mango - Wikipedia",
                "link": "https://en.wikipedia.org/wiki/Mango",
                "description": "Mango fruits – single and halved. A mango is an edible stone fruit produced by the tropical tree Mangifera indica. It is believed to have originated in southern Asia, particularly in eastern India, Bangladesh, and the Andaman Islands."
            },
            {
                "title": "Mango: Nutrition, Health Benefits, and How to Eat It",
                "link": "https://www.healthline.com/nutrition/mango",
                "description": null
            },
            {
                "title": "Learn About Mango Fruit - Facts, Nutrition, & More | Mango Board",
                "link": "https://www.mango.org/about-mangos/",
                "description": "Learn all about mangos. From their journey on the mango tree, how to choose them at the grocery store and how to cut them. Visit Mango.org today!"
            },
            {
                "title": "Mango: Health Benefits, Nutrients per Serving, Preparation ...",
                "link": "https://www.webmd.com/diet/health-benefits-mango",
                "description": "Mangoes are sweet, colorful, and nutritious fruits that can help lower your risk of cancer, support your heart health, and improve your digestive health. Learn about the types, nutrition, preparation, and benefits of mangoes from WebMD."
            },
            {
                "title": "Homepage | Mango Languages",
                "link": "https://mangolanguages.com/",
                "description": "Microsoft is an American multinational corporation that develops, manufactures, licenses, supports, and sells a range of software products and services. Over 70 languages to explore Highest-rated language-learning app* 4.8 Start Your Journey How it works Learn it Learn with proven linguistic methodology that ..."
            },
            {
                "title": "31 Mango Recipes That Taste Like Pure Gold | Bon Appétit",
                "link": "https://www.bonappetit.com/recipes/slideshow/mango-recipes",
                "description": "Mar 11, 2022 · Tropical Trifle With Coconut and Rum. This creamy mango dessert features a coconut–chia seed pudding and a rum-soaked combo of fresh fruit (we went with mangoes, bananas, and star fruit, but you ..."
            },
            {
                "title": "Moda de Mulher | Mango Portugal",
                "link": "https://shop.mango.com/pt/mulher",
                "description": "Últimas tendências em moda para mulheres. Descubra os nossos designs: vestidos, tops, jeans, sapatos, malas e acessórios. Envio gratuito a partir de 30 € - Devoluções durante 30 dias"
            },
            {
                "title": "20 Best Mango Recipes | What to Make with Mango | Recipes ...",
                "link": "https://www.foodnetwork.com/recipes/photos/mango-recipes",
                "description": "Mango Float. You'll want the ripest and juiciest mangoes to really do justice to this popular Filipino dessert. Made of layered whipped sweetened cream, graham cracker crumbs and fruit that's ..."
            },
            {
                "title": "Modă pentru Femei | Mango România",
                "link": "https://shop.mango.com/ro/femei",
                "description": "Valabil în magazinele și online din România. In limita stocului disponibil. Discountul maxim se aplică la colecția pentru femei Mango. Pentru restul liniilor de produse, se aplică un discount egal sau mai mic. Discountul nu se aplică noii colecții. Discountul anunțat se va aplica prețului marcat la începutul sezonului."
            }
        ]
    },
    "error": null
}